# LObject

## Description
Function LObject returns a handle to the last object in the first layer of the active document.

```pascal
FUNCTION LObject : HANDLE;
```

```python
def vs.LObject():
    return HANDLE
```

## Examples
```pascal
resultH := LObject;
```
```python
import vs

# Function LObject returns a handle to the last object in the first layer of
# the active document.
objHandle = vs.LObject()
if objHandle is not None:
    vs.Message('Created object handle: ' + str(objHandle))
```

## See Also
Relative calls:
* NextObj | PrevObj
* FObject | LObject
* FSActLayer | LSActLayer
* FSObject  | LActLayer
* NextDObj | PrevDObj
* NextSObj | PrevSObj

## Version
Availability: from All Versions

## Category
* Document List Handling